z_performance/results/api-customer-docker-wrk.txt
Running 30s test @ http://localhost:8000/api/customer
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    81.92ms  204.66ms   1.08s    89.84%
    Req/Sec     2.08k   502.51     3.63k    79.43%
  Latency Distribution
     50%   11.81ms
     75%   18.91ms
     90%  297.23ms
     99%  939.36ms
  214525 requests in 30.10s, 55.03MB read
Requests/sec:   7127.32
Transfer/sec:      1.83MB