z_performance/results/api-customer-docker-wrk2.txt
Running 30s test @ http://localhost:8000/api/customer
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.34ms  101.92ms   1.02s    97.25%
    Req/Sec     2.03k   361.61     3.34k    73.88%
  Latency Distribution
     50%   11.65ms
     75%   16.75ms
     90%   22.94ms
     99%  696.73ms
  235270 requests in 30.03s, 60.36MB read
Requests/sec:   7833.74
Transfer/sec:      2.01MB