z_performance/results/api-customer-docker-wrk2.txt
Running 30s test @ http://localhost:8000/api/customer
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.45ms   17.76ms 216.61ms   74.22%
    Req/Sec   819.06    149.55     1.61k    72.58%
  Latency Distribution
     50%   30.95ms
     75%   40.04ms
     90%   51.35ms
     99%   86.35ms
  97880 requests in 30.03s, 25.11MB read
Requests/sec:   3258.91
Transfer/sec:    856.10KB