z_performance/results/api-customer-host-baseline-wrk.txt
Running 30s test @ http://localhost:8000/api/customer
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms  402.95us  19.72ms   89.06%
    Req/Sec    19.64k     1.25k   24.50k    69.17%
  Latency Distribution
     50%    1.25ms
     75%    1.35ms
     90%    1.51ms
     99%    2.41ms
  2345224 requests in 30.01s, 601.64MB read
Requests/sec:  78146.28
Transfer/sec:     20.05MB