z_performance/results/api-customer-host-baseline-wrk2.txt
Running 30s test @ http://localhost:8000/api/customer
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.25ms  340.86us  22.55ms   84.92%
    Req/Sec    19.83k     1.85k   69.11k    88.26%
  Latency Distribution
     50%    1.24ms
     75%    1.35ms
     90%    1.50ms
     99%    2.33ms
  2370170 requests in 30.10s, 608.04MB read
Requests/sec:  78742.20
Transfer/sec:     20.20MB